//数组
//有序排列的同类数据元素的集合

//int main()
//{
//	int a[9] = {1,2,3,4,5,6,7,8,9};//括号里可以不写元素数量
//	int a[] = {1,2,3,4,5,6,7,8,9};//这两种写法都一样
//	char  b[5] = { '壹','贰','叁','肆','伍' };
//	double c[5] = { 1.11,2.22,3.33,4.44,5.55 };
//	return 0;
//}

//数值的下标
//数组里面的元素都是有下标的，下标是从0开始的。
//数组可以通过下标来访问的
//例：int a[9] = { 1 , 2 , 3 , 4 , 5 , 6 , 7 , 8 , 9 }
//    下标         0   1   2   3   4   5   6   7   8

//用while循环输出数组里所有的与元素
//int main()
//{
//	int a[9] = {1,2,3,4,5,6,7,8,9};
//	int i = 0;
//	while (i < 5)
//	{
//		printf("%s\n", b[i]);
//		i = i + 1;
//	}
//	return 0;
//}